OpenFOAM_Artery_Lab_ADT/CFD_AAA/example1/AortaOF_N/Aorta_novikov_01/system/controlDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object controlDict;
}

application pimpleFoam;

startFrom latestTime;

startTime 0;

stopAt endTime;

endTime 5.0;

deltaT 1;

writeControl adjustableRunTime;

writeInterval 0.01;

adjustTimeStep yes;
maxCo 0.5;

purgeWrite 0;

writeFormat ascii;

writePrecision 16;

timeFormat general;

timePrecision 8;

runTimeModifiable no;
wallShearStress1
{
  type wallShearStress;
  libs
    (
      fieldFunctionObjects
    ); 	// Mandatory entries (unmodifiable)// Optional entries (runtime modifiable)
  patches
    (
      aortaWall
    ); 	// (wall1 "(wall2|wall3)");// Optional (inherited) entries
  writePrecision 8;
  writeToFile yes;
  useUserTime yes;
  region aortaWall;
  enabled yes;
  log yes;
  timeStart 0;
  timeEnd 4;
  executeControl timeStep;
  executeInterval 1;
  writeControl timeStep;
  writeInterval 10;
} 	// ************************************************************************* //

functions
{
  probes1
  {
    type probes;
    libs
      (
        "libsampling.so"
      ); 	//dictionary probesDict;
    writeControl timeStep;
    writeInterval 20;
    probeLocations
      (
        (5.57815e-05 -0.000132137 -0.00548509)
        (7.82973e-05 -0.000125102 -0.0112403)
        (5.43567e-05 -0.000111584 -0.0167301)
        (4.28038e-05 -0.000110016 -0.0223624)
        (5.45815e-05 -0.00012715 -0.0279318)
        (3.90033e-05 -0.00011044 -0.0353926)
        (3.00991e-05 -0.000119329 -0.0409582)
        (0.000503241 -7.83235e-06 -0.0465644)
        (0.00327551 -0.00159194 -0.0511281)
        (0.00625679 -0.00164535 -0.0556714)
        (0.00888672 0.000638518 -0.0624975)
        (0.00976854 0.00163338 -0.0678893)
        (0.0091226 0.00225801 -0.0734734)
        (0.00911004 0.00348724 -0.0787821)
        (0.0108552 0.00572694 -0.0836135)
        (0.0127782 0.00893439 -0.0900858)
        (0.012786 0.0109647 -0.095287)
        (0.0132108 0.0132366 -0.100482)
        (0.014068 0.0158324 -0.105157)
        (0.0142335 0.0204698 -0.112041)
      );
    fields
      (
        p
        U
      );
  }
} 	// ************************************************************************* //

