OpenFOAM_Artery_Lab_ADT/CFD_AAA/example1/AortaOF_N/Aorta_novikov_01/system/blockMeshDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object blockMeshDict;
}

convertToMeters 1;

vertices (  (-0.12038598485339744 -0.05159100810929238 -0.15721997369135082)
 (0.028764527624530172 -0.05159100810929238 -0.15721997369135082)
 (0.028764527624530172 0.016499617871694867 -0.15721997369135082)
 (-0.12038598485339744 0.016499617871694867 -0.15721997369135082)
 (-0.12038598485339744 -0.05159100810929238 -0.0004999999114829409)
 (0.028764527624530172 -0.05159100810929238 -0.0004999999114829409)
 (0.028764527624530172 0.016499617871694867 -0.0004999999114829409)
 (-0.12038598485339744 0.016499617871694867 -0.0004999999114829409));

blocks (hex (0 1 2 3 4 5 6 7) (47 21 50) simpleGrading (1 1 1));

edges
  (
  );

boundary
  (
    outlet

    {
      type slip;
      faces
        (

          (
            0
            3
            2
            1
          )
        );

    }
    inlet

    {
      type slip;
      faces
        (

          (
            4
            5
            6
            7
          )
        );

    }
  ); 	// ************************************************************************* //

