OpenFOAM_Artery_Lab_ADT/CFD_AAA/example1/AortaOF_N/Aorta_novikov_01/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    outlet
    {
        type            slip;
        inGroups        List<word> 1(slip);
        nFaces          987;
        startFace       152411;
    }
    inlet
    {
        type            slip;
        inGroups        List<word> 1(slip);
        nFaces          980;
        startFace       153398;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          7044;
        startFace       154378;
    }
    aortaWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          2045;
        startFace       161422;
    }
)

// ************************************************************************* //
